espressif/esp-idf/examples/bluetooth/nimble/power_save/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

# MODEM SLEEP Options
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y
# Bluetooth low power clock
CONFIG_BT_CTRL_LPCLK_SEL_EXT_32K_XTAL=y

# RTC clock source
CONFIG_RTC_CLK_SRC_EXT_CRYS=y

# Run FreeRTOS only on first core
CONFIG_FREERTOS_UNICORE=y
# Enable power down of MAC and baseband in light sleep mode
CONFIG_ESP_PHY_MAC_BB_PD=y
